app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$04$wmTzJXaPtZfJDI5EGzPUz..Fudrx2sgfG4d8ru8GZYM4rSdzArQuq"], ["updated_at", "2019-10-27 06:35:25.864954"], ["id", 950961012]]